Show / Hide Table of Contents
Class RebarShape
Represents a geometrical shape for Rebar in 3D space.
Inheritance
System.Object
OpenObject
OpenElementId
RebarShape
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RebarShape,CI.StructuralElements", "CI.StructModel.Structure.IRebarShape,CI.BasicTypes")]
public class RebarShape : OpenElementId
Properties
Improve this Doc   View Source
EndHook
Gets or sets the end rebar hook.
Declaration
public RebarHookBase EndHook { get; set; }
Property Value
 Type |  Description
 RebarHookBase
Improve this Doc   View Source
SourceGeometry
Gets or sets the segments of the rebar shape.
Declaration
public RebarPolyLine3D SourceGeometry { get; set; }
Property Value
 Type |  Description
 RebarPolyLine3D
Improve this Doc   View Source
StartHook
Gets or sets the start rebar hook.
Declaration
public RebarHookBase StartHook { get; set; }
Property Value
 Type |  Description
 RebarHookBase
 Improve this Doc
 View Source